OdRxBoxedValue.comparedTo(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Establishes an order relation with another value.
\returns
OdRx::Ordering::kLessThan if this object is less than the specified object;
OdRx::Ordering::kEqual if this object is equal to the specified object;
OdRx::Ordering::kGreaterThan if this object is greater than the specified object;
OdRx::Ordering::kNotOrderable if these objects cannot be ordered.

OdRxBoxedValue.isEqualTo(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Compares this value with another value.
\param other [in] Object which to compare this value with.
\returns
true if values of both objects are equal; false otherwise.

OdRxBoxedValue.copyFrom(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Copies contents from another value.
\param other [in] Object to copy value from.

OdRxBoxedValue.clone
\details
Clones this value.
\returns
Reference to the cloned object.

OdRxBoxedValue.newBoxedValueOnHeap(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new boxed value on the heap. Returns a reference-counted smart
pointer.
\param value [in] Object of the OdRxValue to be wrapped.
\returns
Reference-counted smart pointer to the created OdRxBoxedValue object.

OdRxBoxedValue.value
\details
Returns contained OdRxValue.
\returns
Contained OdRxValue.
\details
Returns contained OdRxValue.
\returns
Contained OdRxValue.